upstream/OpenFOAM-v2606/etc/templates/inflowOutflowRotating/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fixed.obj
{
    #includeEtc "caseDicts/surface/surfaceFeatureExtractDict.cfg"
}

rotating.obj
{
    #includeEtc "caseDicts/surface/surfaceFeatureExtractDict.cfg"
}

rotatingZone.obj
{
    #includeEtc "caseDicts/surface/surfaceFeatureExtractDict.cfg"
}

// ************************************************************************* //
